УправлениеРассылками/src/Documents/Рассылка/Рассылка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рассылка</name>
  <basedOn>Document.ЗаявкаНаРассылку</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ТемаРассылки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРассылку</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатели</name>
    <type>
      <types>CatalogRef.СегментыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчётныеЗаписиЭП</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

УправлениеРассылками/src/InformationRegisters/Очередь/Очередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Очередь</name>
  <resources>
    <name>УчетнаяЗаписьЭП</name>
    <type>
      <types>CatalogRef.УчётныеЗаписиЭП</types>
    </type>
  </resources>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.Рассылка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеРассылками/src/Documents/Рассылка/Forms/ФормаДокументаРассылка/Module.bsl
&НаКлиенте
Процедура ОтправитьПисьмаВОчередь(Команда)
	Если не ЗначениеЗаполнено(Объект.Ссылка) тогда
		ПоказатьПредупреждение(,"Перед отправкой сохраните рассылку", 10);
		//если пармаетры были изменены, в случае повторной 
		//отправки писем в очередь они изменятся и там тоже
	Иначе ОтправитьПисьмаВОчередьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмаВОчередьНаСервере()
	
	Контрагенты = новый Массив;
	Выборка = Объект.Получатели.Состав;
	
	Для каждого к из Выборка цикл
		Контрагенты.Добавить(к.Контрагент.Ссылка);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Контрагенты Цикл 
		МенеджерЗаписи = РегистрыСведений.Очередь.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Рассылка = Объект.Ссылка;
		МенеджерЗаписи.Контрагент = СтрокаТаблицы;
		МенеджерЗаписи.УчетнаяЗаписьЭП = Объект.УчетнаяЗапись;
		МенеджерЗаписи.ДатаОтправки = Объект.ДатаОтправки;
		МенеджерЗаписи.Записать();
		
	КонецЦикла; 
КонецПроцедуры
